/*题目描述

对于给定的正整数N，求它的位数及其各位数字之和。
输入

321
输出

3 6
样例输入

321
样例输出

3 6
*/
#include <stdio.h>

int main()
{
 	int a,b=0,c=0;
	scanf("%d",&a);
do{ 
	c++;//相当于计算次数。 	
	a/=10;//a=a/10                             321/10=32.1?  32/10=3.2?   3/10=0.3?
	b+=a%10;//b=b+a%10    321%10=?  余1 32%10？余2   3 %10？ 余3[想明白]   b有值了 1+2+3 
	
	}
while(a>0);
printf("%d %d",c,b);
return 0;
}                 
	

/*思路拓展：
输入123 出来的是321

　int n,a,b,c;
　　scanf("%d",&n);
　　a=n/100;
　　b=(n/10)%10;
　　c=n%10;
　　printf("\n倒序输出结果：%d%d%d",c,b,a);
*/ 

 
